app/Views/layout/header.php

SELECT *
FROM `merchants`
WHERE `user_id` = '3'
 LIMIT 1
---
if ($isLoggedIn) {
    $merchantModel = new \App\Models\MerchantModel();

    $merchant = $merchantModel
        ->where('user_id', $session->get('user_id'))
        ->first();