app/Filters/MerchantAuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();

        // 1. CEK LOGIN DASAR
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $userId = $session->get('user_id');
        $merchantModel = new MerchantModel();

        // 2. CEK DATA MERCHANT DI DATABASE
        $merchant = $merchantModel->where('user_id', $userId)->first();
---
SELECT *
FROM `merchants`
WHERE `user_id` = '4'
 LIMIT 1