app/Controllers/Admin.php

SELECT *
FROM `merchants`
WHERE `status` = 'pending'
---
    public function index()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to(base_url('login'));
        }

        $data = [
            'title' => 'Dashboard Admin',
            'pending_merchants' => $this->merchantModel->where('status', 'pending')->findAll(),
        ];

SELECT *
FROM `merchants`
WHERE `merchants`.`id` = '9'
UPDATE `merchants` SET `status` = 'approved', `updated_at` = '2025-12-07 16:32:54'
WHERE `merchants`.`id` IN ('9')
UPDATE `users` SET `role` = 'merchant'
WHERE `users`.`id` IN ('6')
---
    public function approveMerchant($id)
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to(base_url('login'));
        }

        $merchant = $this->merchantModel->find($id);

        if ($merchant) {
            // 1. Update Status di Tabel Merchants (GUNAKAN 'approved' bukan 'Verified')
            $this->merchantModel->update($id, ['status' => 'approved']);

            // 2. Update Role di Tabel Users
            $this->userModel->update($merchant['user_id'], ['role' => 'merchant']);