app/Controllers/Auth.php

    public function processLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $merchantModel = new MerchantModel();

        $user = $userModel->where('email', $email)->first();

        if ($user && password_verify($password, $user['password'])) {


            $sessData = [
                'id'         => $user['id'],
                'user_id'    => $user['id'],
                'user_name'  => $user['name'],
                'user_email' => $user['email'],
                'role'       => $user['role'],
                'isLoggedIn' => TRUE
            ];

            $redirectUrl = base_url('/');

            // === CEK ROLE ADMIN ===
            if ($user['role'] === 'admin') {
                $redirectUrl = base_url('admin/dashboard');
            }
            // === CEK MERCHANT ===
            else {
                $merchant = $merchantModel->where('user_id', $user['id'])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'udin@gmail.com'
 LIMIT 1
SELECT *
FROM `merchants`
WHERE `user_id` = '4'
 LIMIT 1

                        $sessData['role'] = 'merchant';

                        // Update role di database juga (untuk konsistensi)
                        $userModel->update($user['id'], ['role' => 'merchant']);
---
UPDATE `users` SET `role` = 'merchant'
WHERE `users`.`id` IN ('4')