app/Controllers/Marketplace.php

SELECT *
FROM `products`
 LIMIT 10
---
    public function index()
    {
        $productModel = new ProductModel();
        $products = $productModel->findAll(10);