app/Controllers/MerchantDashboard.php

    public function index()
    {
        $session = session();

        // Cek apakah user sudah login dan role-nya merchant
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'merchant') {
            return redirect()->to(base_url('login'))->with('error', 'Silakan login sebagai merchant');
        }

        $userId = $session->get('user_id');
        $merchant = $this->merchantModel->where('user_id', $userId)->first();
---
SELECT *
FROM `merchants`
WHERE `user_id` = '1'
 LIMIT 1

    public function reservations()
    {
        $session = session();
        $userId = $session->get('user_id');
        $merchant = $this->merchantModel->where('user_id', $userId)->first();
---
SELECT *
FROM `merchants`
WHERE `user_id` = '4'
 LIMIT 1