app/Models/MerchantModel.php

    public function getApprovedMerchants()
    {
        return $this->where('status', 'approved')->findAll();
---
SELECT *
FROM `merchants`
WHERE `status` = 'approved'